do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "🌞نورت  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🎃🎃"KASPER"🎃🎃
     🏳🏴➖➖👾➖➖🏴🏳
         
🎃 - م1 -
    ⸄⸄⸄⸄ لعرض الاوامر الاساسية  ⸅⸅⸅⸅
🎃 - م2 -
    ⸄⸄⸄⸄  لعرض الاوامر الاساسية 2  ⸅⸅⸅⸅
🎃 - م3 -
  ⸄⸄⸄⸄  لعرض الاوامر حماية المجموعة  ⸅⸅⸅⸅
🎃 - م المطور -
   ⸄⸄⸄⸄  لعرض اوامر المطور ⸅⸅⸅⸅
  
  🏳🏴➖➖👾➖➖🏴🏳
👨‍💻D⃞E⃞: @USA_KASPER1K
 🤖H⃞: @USA_KASPER1K
🏳🏴➖➖➖👾➖➖➖🏴🏳
]].."\n"
.."".."\n"
..''..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "نورت  😍😋 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🏴اهلا وسهلا بك في (الاوامر الاساسية)🏴
  🏳🏴➖➖👾➖➖🏴🏳
🎃 معلومات المجموعه ⚠
࿘ لُْعرَضُ مٌْعلُوَمٌاتْ الُمٌجْمٌوَْعُه ࿘
⚠️ الاعدادات 🎃
࿘ لُْعرَضُ الُاْعدِادِتْ فَيَ الُمٌجْمٌوَْعُه ࿘
🎃 موقعي ⚠️
࿗ لُْعرَضُ رَتْبّتْكِ فَيَ الُمٌجْمٌوَْعُه ࿘ 
  
🎃 رفع ادمن ⚠️
࿗ لُرَفَْع ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه ࿗
 ⚠️ تنزيل ادمن 🎃
࿗ لُتْنَزُيَلُ ادِمٌنَ فَيَ الُمٌجْمٌوَْعُه ࿗
 🎃الادمنيه⚠️
࿗ لُْعرَضُ الُادِمٌنَيَُه فَيَ الُمٌجْمٌوَْعُه ࿘
   🏳🏴➖➖👾➖➖🏴🏳
👨‍💻D⃞E⃞: @USA_KASPER1K
 🤖H⃞: @USA_KASPER1K
🏳🏴➖➖➖👾➖➖➖🏴🏳
]].."\n"
.."".."\n"
..''..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "نورت🌚🎃 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🏴اهلا وسهلا بك في (الاوامر الاساسية(2))🏴
  🏳🏴➖➖👾➖➖🏴🏳
 
⚠️ الرابط 🎃
((لُْعرَضُ الُرَابّطِ فَيَ الُمٌجْمٌوَْعُه )) 
 🎃 وضع رابط ⚠️
(( وَضُْع رَابّطِ فَيَ الُمٌجْمٌوَْعُه ))
 ⚠️ رابط جديد 🎃
((لُْعرَضُ رَابّطِ الُجْدِيَدِ فَيَ الُمٌجْمٌوَْعُه))
 🎃 ضع قوانين ⚠️
(( لُوَضُْع قًوَانَيَينََ لُلُمٌجْمٌوَْعُه ))
 ⚠️ القوانين 🎃
(( لُرَؤيَُه الُقًوَانَيَنَ فَيَ الُمٌجْمٌوَْعُه ))   
 🎃 ضع وصف ⚠️
((لوَضُْع وَصّفَ فَيَ الُمٌجْمٌوَْعُه  ))
 ⚠️ ضع اسم 🎃
((لُوَضُْع اسِمٌ لُلُمٌجْمٌوَْعُه  )) 
 🎃 ضع صورة ⚠️
((لُوَضُْع صّوَرَُه فَيَ الُمٌجْمٌوَْعُه ))
 ⚠️ حذف الادمنية 🎃
((الحُذَفَ الُادِمٌنَيَُه فَيَ الُمٌجْمٌوَْعُه   )) 
 🎃 الوصف ⚠️
(( لُحُذَفَ الُوَصّفَ فَيَ الُمٌجْمٌوَْعُه   ))
 ⚠️ المكتومين 🎃
(( الحُذَفَ الُمٌكِتْوَمٌيَنَ فَيَ الُمٌجْمٌوَْعةِ ))
 🎃 حذف القوانين  ⚠️  
 ((لُحُذَفَ الُقًوَانَيَنَ فَيَ الُمٌجْمٌوَْعُه ))
🏳🏴➖➖👾➖➖🏴🏳
👨‍💻D⃞E⃞: @USA_KASPER1K
 🤖H⃞: @USA_KASPER1K
🏳🏴➖➖➖👾➖➖➖🏴🏳
]].."\n"
.."".."\n"
..''..'\n'
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "🌚نورت♥ "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🏴اهلا وسهلا بك في (اوامر حماية المجموعة)🏴
  🏳🏴➖➖👾➖➖🏴🏳
 
 🎃 طرد <معرف-رد> ⚠️
(( لطرد لعضو من المجموعه))
🎃كتم <معرف-رد>⚠️
    ((كتم العضو في المجموعه ))
🎃 حظر <معرف-رد> ⚠️
        ((لحظر العضو في المجموعه ))
🎃الغاء الحظر <معرف-رد⚠️
             ((الغاء الحظر في المجموعه))
🎃 قائمة الحظر ⚠️
((لعرض  المحظورين في المجموعه))
🏳🏴➖➖➖👾➖➖➖🏴🏳
🏴🏳    اوامر قفل والفتح          🏳🏴 
🏳🏴➖➖➖👾➖➖➖🏴🏳
🎃قفل الصوت ⚠️
         (( لمنع الصوتيات )) 
🎃 قفل الصور المتحركة⚠️
                  ((لمنع المتحركة ))
🎃 قفل الصور ⚠️
             (( لمنع الصور ))
🎃 قفل الفيديو ⚠️
           ((لمنع الفديوات ))
🎃 قفل التكرار ⚠️
              ((لمنع التكرار ))
🎃 قفل البوتات ⚠️
               ((لمنع البوتات ))
🎃 قفل الروابط ⚠️
       ((لمنع الروابط  ))
🎃 قفل الاضافة ⚠️
            (( لمنع الاضافة ))
🎃قفل الاضافة الجماعية⚠️
                    ((لمنع الجماعية ))  
🎃قفل اشعارات⚠️
               (( اشعارات الدخول))  
🎃قفل جهات اتصال⚠️
               ((جهات الاتصال  ))
🎃 قفل الكلايش ⚠️
              ((لمنع الكلايش))  
 
🎃 قفل الوسائط ⚠️
              ((لمنع كل الميديا))  
🎃 قفل الدردشه ⚠️
               ((لمنع المحادثة  ))
🎃 قفل العربيه ⚠️
               ((اللغة العربية ))
  🏳🏴➖➖➖👾➖➖➖🏴🏳
🤔طريقة استخدام الاوامر ⚠️ 
👾 قفل + الامر ⇐ للقفل🏳 
👾  فتح + الامر ⇐ للفتح 🏴
🏳🏴➖➖➖👾➖➖➖🏴🏳
🏴🏳    اوامر قفل التوجيه          🏳🏴 
🏳🏴➖➖➖👾➖➖➖🏴🏳
🎃حذف توجيه ⚠️ فتح حذف توجيه 🎃
         (( لفتح وغلق حذف توجيه بدون تحذير )) 
🎃تحذير توجيه ⚠️فتح تحذير توجيه 🎃
         (( لفتح وغلق حذف + تحذير توجيه  ))
 🎃طرد توجيه ⚠️فتح طرد توجيه 🎃
         (( لفتح وغلق حذف + طرد من يقوم بالتوجيه  )) 
🏳🏴➖➖👾➖➖🏴🏳
👨‍💻D⃞E⃞: @USA_KASPER1K
 🤖H⃞: @USA_KASPER1K
🏳🏴➖➖➖👾➖➖➖🏴🏳
]].."\n"
.."".."\n"
..' '..'\n'
-----------------------

 elseif  matches[1] == "م المطور" and is_sudo(msg) then 
    return "نورت بعد بيتي  😍🎃 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🏴اهلا وسهلا بك في (🎃اوامر المطور 😽)🏴
  🏳🏴➖➖👾➖➖🏴🏳
😇➖➖➖➖➖➖➖➖😇
🎃 تفعيل ⚠️
 ((لُتْفَْعيَلُ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه ))
🎃 تعطيل ⚠️
((لُتْْعطِيَلُ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه)) 
 🎃اذاعه ⚠️
 ((لُْعمٌلُ اذَاْعُه فَيَ الُمٌجْمٌوَْعاتْ))
🎃 نظف ⚠️
((لُتْنَظٌيَفَ الُمٌجْمٌوَْعُه بّلُ ْعدِدِ))
 🎃طرد البوت ⚠️
(( لُطِرَدِ الُبّوَتْ فَيَ الُمٌجْمٌوَْعُه ))
🎃لاضافه رد ⚠️
((رد اضف +اسم الرد + الرد التريده))
 🎃رد حذف +اسم ⚠️
              (( لُحُدِفَــــ الُرَدِ ))
 🎃الردود ⚠️
((لْعرَضُ الُرَدِوَدِ الُتْيَ تْمٌ اضُافَتُْهنَ)) 
 🎃الملفات ⚠️
((لْعرَضُ مٌلُفَاتْ الُبّوَتْ)) 
 🎃تفعيل الملف ⚠️
 ((لتْفَْعيَلُ الُمٌلُفَ مٌنَ دِاٌخلُ الُمٌجْمٌوَْعُه ))
 🎃تعطيل الملف⚠️
((لتْْعطِيَلُ الُمٌلُفَ مٌنَ دِاٌخلُ الُمٌجْمٌوَْعُه ))
 🎃جلب الملف ⚠️
(( لجْلُبّ مٌلُفَاتْ الُبّوَتْ ))
 🎃حذف ملف والاسم ⚠️ مثال :- حذف ملف run
(( حذف ملف من سيرفر ))
‏🎃/save plugins/اسم الملف.lua  ⚠ بالرد   
(( لضافة ملف من الهاتف ))
 🎃صنع مجموعه ⚠️
((لصنع مجموعه من البوت))
🏳🏴➖➖➖👾➖➖➖🏴🏳
        🏴🏳اوامر الران او تصحيح🏴🏳
              
‏🌞 run🎃
(( لتْنَشِيَطِ الُسِيَرَفَرَ دِاٌخلُ الُمٌجْمٌوَْعُه))
‏🌞 update🎃
 ((لتْحُدِيثُ الُسِيَرَفَرَ  دِاٌخلُ الُمٌجْمٌوَْعُه))
‏🌞 redis 🎃
((لتْصّحُيَحُ الُبّوَتْ دِاٌخلُ الُمٌجْمٌوَْعُه))
      
🏳🏴➖➖➖👾➖➖➖🏴🏳
🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃
🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃
🏳🏴➖➖👾➖➖🏴🏳
👨‍💻D⃞E⃞: @USA_KASPER1K
 🤖H⃞: @USA_KASPER1K
🏳🏴➖➖➖👾➖➖➖🏴🏳
]].."\n"
.."".."\n"
..' '..'\n'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م المطور)",

  },
  run = run
}
end
